# 开发者: wang
# 开发时间：2021/12/2 0002 16:44
# range


# range()对象 生成一个数字序列 用的都是同一个内存地址


print('-----------------------第一种创建方式----------------------')
# list() 就是类似于数组列
# range() 你放入10 输出(0,10)
print(range(10))  # 单个值的时候 默认从0开始
print(list(range(10)))  # 默认从0开始 所以list中0-9 与默认值相差1
print('----------------------第二种创建方式------------------------')
print(range(1, 10))  # 输出(1,10)
print(list(range(1, 10)))  # range 从1开始 所以 1-9 与默认值相差1
print('----------------------第三种创建方式------------------------')
# range(1---->到10-----之间相差2的数字)
print(range(1, 10, 2))  # 输出(1,10)
print(list(range(1, 10, 2)))  # range 1 到 10 之间不是2 的倍数
print('----------------------判断数字是否在这个队列里面-----------------')
r = range(10)
print(10 in r)  # 10不在r的队列中 False
print(9 in r)  # 9在r的队列中 True

print(10 not in r)  # 10不在r里面是对的 True
print(9 not in r)  # 9不在r里面是错的 False
